In [41]:
import pandas as pd

In [4]:
serie_de_numeros = [1,2,3,4,5,6]
serie = pd.Series(serie_de_numeros)

serie, type(serie)

(0    1
 1    2
 2    3
 3    4
 4    5
 5    6
 dtype: int64,
 pandas.core.series.Series)

In [9]:
data = {
    "Nombre": ["Juan", "Elias", "Esteban"],
    "Edad": [11, 17, 14],
    "Ciudad": ["Cba", "Bue", "Men"]
}

dataFrame = pd.DataFrame(data=data)
dataFrame, type(dataFrame)
#data, type(data)

(    Nombre  Edad Ciudad
 0     Juan    11    Cba
 1    Elias    17    Bue
 2  Esteban    14    Men,
 pandas.core.frame.DataFrame)

In [ ]:
#Exportar csv
dataFrame.to_csv("data.csv")

#Importar csv
nuevo_df = pd.read_csv("data.csv", index_col=0)
nuevo_df

    Nombre  Edad Ciudad
0     Juan    11    Cba
1    Elias    17    Bue
2  Esteban    14    Men

In [14]:
#Los data frames estan conformados por series de pandas, entonces:
nombres = dataFrame["Nombre"]
print(nombres, type(nombres))

0       Juan
1      Elias
2    Esteban
Name: Nombre, dtype: object <class 'pandas.core.series.Series'>

In [15]:
#Podemos seleccionar varias columnas de la siguiente manera:
nombre_edad = dataFrame[["Nombre", "Edad"]]
print(nombre_edad, type(nombre_edad))

    Nombre  Edad
0     Juan    11
1    Elias    17
2  Esteban    14 <class 'pandas.core.frame.DataFrame'>

In [17]:
#Filtrar por indice:
fila_obtenida = dataFrame.loc[2]
print(fila_obtenida, type(fila_obtenida))

Nombre    Esteban
Edad           14
Ciudad        Men
Name: 2, dtype: object <class 'pandas.core.series.Series'>

In [ ]:
#Filtrar segun una condicion:
personas_filtradas = dataFrame[dataFrame["Edad"] > 13]
personas_filtradas

    Nombre  Edad Ciudad
1    Elias    17    Bue
2  Esteban    14    Men

In [32]:
filtro = ([dataFrame["Edad"] < 16]) and (dataFrame["Nombre"].str.startswith("E"))
dataFrame[filtro]

    Nombre  Edad Ciudad
1    Elias    17    Bue
2  Esteban    14    Men

In [34]:
# Tambien se pueden hacer filtros por querys

dataFrame.query("Edad > 13")

    Nombre  Edad Ciudad
1    Elias    17    Bue
2  Esteban    14    Men

In [ ]:
dataFrame[dataFrame["Nombre"].isin(["Elias", "Esteban"])]

In [35]:
# Filtro aplicando una funcion definida por el programador.
def tiene_longitug_de_5(nombre : str) -> bool:
    return len(nombre) == 5

dataFrame[dataFrame["Nombre"].apply(tiene_longitug_de_5)]

  Nombre  Edad Ciudad
1  Elias    17    Bue

In [38]:
#Filtro tomando como condicion un rango de valores
dataFrame[dataFrame["Edad"].between(15,35)]

  Nombre  Edad Ciudad
1  Elias    17    Bue

In [39]:
import numpy as np

In [43]:
data = {
    "Nombre": ["Juan", "Elias", "Esteban"],
    "Edad": [11, np.nan, 14],
    "Ciudad": ["Cba", None, "Men"]
}

df = pd.DataFrame(data)
df

    Nombre  Edad Ciudad
0     Juan  11.0    Cba
1    Elias   NaN   None
2  Esteban  14.0    Men

In [45]:
# Rellenar valores

df_filled = df.fillna(
    {
        "Edad": df["Edad"].mean(),
        "Ciudad": "Desconocido"
    }
)
df_filled

# Pero... Si quisiera eliminar aquellas filas con nulos para no arruinar el promedio de valores, hago esto:
#df_sin_nulos = df.dropna()
#df_sin_nulos

    Nombre  Edad       Ciudad
0     Juan  11.0          Cba
1    Elias  12.5  Desconocido
2  Esteban  14.0          Men

In [47]:
df_reem = df.replace(
    {
        "Ciudad": {None: "Desconocido", "Cba" : "Cordoba", "Men": "Mendoza"}
    }
)
df_reem

    Nombre  Edad       Ciudad
0     Juan  11.0      Cordoba
1    Elias   NaN  Desconocido
2  Esteban  14.0      Mendoza

In [48]:
df_interpolado = df.copy()
df_interpolado["Edad"] = df["Edad"].interpolate()
df_interpolado

    Nombre  Edad Ciudad
0     Juan  11.0    Cba
1    Elias  12.5   None
2  Esteban  14.0    Men

In [50]:
data = {
    "Nombre": ["Juan", "Elias", "Esteban", "Juan", "Elias", "Esteban", "Juan", "Elias"],
    "Edad": [11, np.nan, 14, 11, np.nan, 14, 11, np.nan],
    "Ciudad": ["Cba", None, "Men", "Cba", None, "Men", "Cba", None]
}

data_duplicado = pd.DataFrame(data=data)

data_duplicado = data_duplicado.drop_duplicates()
data_duplicado

    Nombre  Edad Ciudad
0     Juan  11.0    Cba
1    Elias   NaN   None
2  Esteban  14.0    Men